ednieuw/RTCcheck/Old/ESP32_RTCcheckV009/ESP32_RTCcheckV009.ino
  // NTP time already in local time
  time_t tNTP = mktime(&timeinfo);

  RTCdiffSec[i] = abs(tNTP - tRTC);
 }
} 

//--------------------------------------------                       //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max time difference = 25 seconds. 26 = NA
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 CalcDifRTCtimes();                                                 // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                  // Read time of all ACTIVE RTC modules
  {
   int c;
   if (!rtcActive[i]) c = 26;                                     // Skip non-active RTC's 
   else c = RTCdiffSec[i]; 
   switch (c)
    {
      case  0 ...  1: ColorLed(i,green);        break;
      case  2 ...  4: ColorLed(i,orange);       break;
      case  5 ...  7: ColorLed(i,greenblue);    break;
      case  8 ... 10: ColorLed(i,darkviolet);   break;
      case 11 ... 17: ColorLed(i,pink);         break;
      case 18 ... 25: ColorLed(i,purple);       break;
      case 26:        ColorLed(i,blue);         break;
      default:        ColorLed(i,red); 
    }
  }
ShowLeds(); 
}

//--------------------------------------------                       //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 Tekstprint(" ");
 CalcDifRTCtimes();
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   sprintf(sptext,"|T%d:%2ld",i,RTCdiffSec[i]);
   Tekstprint(sptext);
  }
 Tekstprint("| ");
}
//--------------------------------------------                       //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                           // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                          // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) 
   {
    sprintf(sptext,"Error selecting channel %d Error code : %d", channel,error);
    Tekstprintln(sptext);  
  }
  delay(10);                                                         // short delay after channel change
}
//--------------------------------------------                       //
// RTC8 set Time For RTC 
//--------------------------------------------
void setTimeForRTC(int rtcIndex, DateTime newTime) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                       //
// RTC8 Print Time For RTC 
//--------------------------------------------
void printTimeForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  DateTime now = rtc[rtcIndex].now();

  sprintf(sptext,"RTC %d: %s", rtcIndex, now.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);  
}
//--------------------------------------------                       //
// RTC8 get Temperature For RTC
//--------------------------------------------
float getTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
//--------------------------------------------
void synchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) { if (rtcActive[i]) { referenceRTC = i;   break;  }  }
  if (referenceRTC == -1)           { Tekstprintln("No active RTC's found!"); return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = getLocalDateTime() + 1;                                               // Get the current time and add 1 sec setting time  
  
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");
  sprintf(sptext,"Reference time of NTP RTC %d: %s", referenceRTC, referenceTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);

  for (int i = 0; i < MAX_RTC; i++) 
   {
    if (!rtcActive[i]) continue;
    selectTCAChannel(i);
    delay(50);
    DateTime before = rtc[i].now();                                  // Show time before update
    sprintf(sptext,"RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    Tekstprintln(sptext);
    rtc[i].adjust(referenceTime);                                    // Update time
    delay(50); 
    DateTime after = rtc[i].now();                                   // Verify
    sprintf(sptext,"RTC %d:  after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    Tekstprintln(sptext);
  }
 Tekstprintln("Synchronisation done!\n");
}

//--------------------------------------------                       //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void setCurrentTime() 
{
 int year, month, day, hour, minute, second;                        //
 hour   = timeinfo.tm_hour;
 minute = timeinfo.tm_min;
 second = timeinfo.tm_sec;
 year   = timeinfo.tm_year + 1900;                                                      // Inow.year() is years since 2000 tm_year is years since 1900
 month  = timeinfo.tm_mon  + 1;
 day    = timeinfo.tm_mday;
 DateTime newTime(year, month, day, hour, minute, second);
 Tekstprint("New time: ");
 Tekstprintln(newTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     delay(50);      
     DateTime before = rtc[i].now();                                // Show time before update
     sprintf(sptext,"RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     Tekstprintln(sptext);
     rtc[i].adjust(newTime);
     delay(50);
     DateTime after = rtc[i].now();                                 // Verify
     sprintf(sptext,"RTC %d: after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     Tekstprintln(sptext);
    }
 Tekstprintln("All active RTC's updated!\n");
}

//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(int Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    SetStatusLED((Toggle && WiFi.localIP()[0]==0) * 20, 
                 (Toggle && WiFi.localIP()[0]!=0) * 20 , 
                 (Toggle &&      deviceConnected) * 20);
    SetPCBLED09( Toggle * 10);                                                                // Left LED
    SetPCBLED10((1-Toggle) * 10);                                                             // Right LED
    SetNanoLED13((1-Toggle) * 50);                                                            // LED on ESP32 board
   }
   else
   {
    SetStatusLED(0, 0, 0); 
    SetPCBLED09(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 512. 0 is LED On max intensity
// 512 is LED off. Therefore the value is subtracted from 512 
//--------------------------------------------
void SetStatusLED(uint16_t Red, uint16_t Green, uint16_t Blue)
{
// For ESP32 with WS2812 LED   
// ColorLed(0,FuncCRGBW( Red,  Green,  Blue, 0)); 
// ShowLeds(); 

// For Arduino Nano ESP32 with  RGB LED 
 analogWrite(LED_RED,   512 - Red);                                                           // !Red (not Red) because 1 or HIGH is LED off
 analogWrite(LED_GREEN, 512 - Green);
 analogWrite(LED_BLUE,  512 - Blue);

